myFoam/tutorials/hyLusgsFoam/DC-35_vib/0/p
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2312                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       volScalarField;
    location    "0";
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 -1 -2 0 0 0 0];

internalField   uniform 18.051341205652395;

boundaryField
{
    wedge_neg
    {
        type            wedge;
    }
    wedge_pos
    {
        type            wedge;
    }
    doubleCone
    {
        type            zeroGradient;
    }
    inlet
    {
        type            fixedValue;
        value           uniform 18.051341205652395;
    }
    outlet
    {
        type            zeroGradient;
    }
}


// ************************************************************************* //
